package exercise_v1.constant;

public enum MemberManagement {

    MEMBER_MEMBER_MENU_TITLE("""
            ------------------<< 일반회원 회원관리 >>------------------
            1.회원 조회 | 2.회원 수정 | 3.회원 탈퇴 | 4.뒤로가기
            ---------------------------------------------------------
            메뉴를 선택해주세요.
            """),
    MANAGER_MEMBER_MENU_TITLE("""
            ---------------------<< 관리자 회원관리 >>-----------------
            1.회원 조회 | 2.회원 수정 | 3.회원 삭제 | 4.뒤로가기
            ---------------------------------------------------------
            메뉴를 선택해주세요.
            """),
    MANAGER_MEMBER_MENU_SEARCH("""
            -------------------<< 관리자 회원 조회 >>------------------
            1.회원상세보기 | 2.전체회원조회 | 3.권한별 회원조회 | 4.뒤로가기
            ---------------------------------------------------------
            메뉴를 선택해주세요.
            """),
    MANAGER_SEARCH_DETAIL_INFO("""
            -------------------<< 회원상세보기 >>----------------------
            조회할 회원의 아이디를 입력하세요.
            """),
    MANAGER_SEARCH_ALL("""
            -------------------<< 전체회원조회 >>----------------------
            """),
    MANAGER_SEARCH_BY_MEMBER_TYPE("""
            -------------------<< 권한별 회원조회 >>-------------------
            1.일반회원     2.관리자
            ---------------------------------------------------------
            조회할 회원들이 보유한 권한을 선택해주세요.
            """),
    MANAGER_INFO_ONE("""
            --------------------<<\t%1$s\t>>--------------------------
            아이디: %1$s
            비밀번호: %2$s
            이름: %3$s
            연락처: %4$s
            이메일: %5$s
            등록일: %6$s
            직급: %7$s
            ----------------------------------------------------------
            """),
    MEMBER_INFO_ONE("""
            --------------------<<\t%1$s\t>>--------------------------
            아이디: %1$s
            비밀번호: %2$s
            소속사: %3$s
            연락처: %4$s
            이메일: %5$s
            사업자번호: %7$s
            주소: %8$s
            계약시작일: %9$s
            계약종료일: %10$s
            ----------------------------------------------------------
            """),
    MEMBER_MENU_PREVIOUS("이전 메뉴로 돌아갑니다.");

    private final String page;

    MemberManagement(String page) {
        this.page = page;
    }

    @Override
    public String toString() {
        return page;
    }
}
