package exercise_v1.constant;

import exercise_v1.domain.Manager;
import jdbc_members.vo.Member;

public enum MemberPage {

    MEMBER_MEMBER_MENU_TITLE("""
            ------------------<< 일반회원 회원관리 >>------------------
            1.내정보조회 | 2.내정보수정 | 3.탈퇴 | 4.뒤로가기
            ---------------------------------------------------------
            메뉴를 선택해주세요.
            """),
    MEMBER_SELECT("내 정보 조회가 완료되었습니다."),
    MEMBER_UPDATE("내 정보 수정이 완료되었습니다."),
    MEMBER_DELETE("회원 탈퇴가 완료되었습니다. 로그인 메뉴로 되돌아갑니다."),

    MANAGER_MEMBER_MENU_TITLE("""
            -------------------<< 관리자 회원관리 >>-------------------
            1.회원 조회 | 2.회원 수정 | 3.회원 삭제 | 4.뒤로가기
            ---------------------------------------------------------
            메뉴를 선택해주세요.
            """),
    MANAGER_SELECT("""
            -------------------<< 관리자 전용 조회 >>------------------
            1.회원상세보기 | 2.전체회원조회 | 3.권한별 회원조회 | 4.뒤로가기
            ---------------------------------------------------------
            메뉴를 선택해주세요.
            """),
    MANAGER_DETAIL_INFO("""
            -------------------<< 회원상세보기 >>----------------------
            조회할 회원의 아이디를 입력하세요.
            """),
    MANAGER_DETAIL("""
            --------------------<<\t%1$s\t>>--------------------------
            아이디: %1$s
            비밀번호: %2$s
            이름: %3$s
            연락처: %4$s
            이메일: %5$s
            입사일: %6$s
            직급: %7$s
            ----------------------------------------------------------
            """),
    MEMBER_DETAIL("""
            --------------------<<\t%1$s\t>>--------------------------
            아이디: %1$s
            비밀번호: %2$s
            소속사: %3$s
            연락처: %4$s
            이메일: %5$s
            사업자번호: %7$s
            주소: %8$s
            계약시작일: %9$s
            계약종료일: %10$s
            ----------------------------------------------------------
            """),

    MANAGER_SEARCH_ALL("""
            -------------------<< 전체회원조회 >>-----------------------
            """),
    MANAGER_SEARCH_BY_MEMBER_TYPE("""
            -------------------<< 권한별 회원조회 >>--------------------
            1.일반회원     2.관리자
            ----------------------------------------------------------
            조회할 회원들이 보유한 권한을 선택해주세요.
            """),

    MANAGER_UPDATE("""
            -------------------<< 관리자 전용 수정 >>------------------
            1.회원정보수정 | 2.회원권한수정 | 3.뒤로가기
            ---------------------------------------------------------
            메뉴를 선택해주세요.
            """),

    CHIEF_MANAGER_DELETE("""
            -------------------<< 총관리자 전용 삭제 >>------------------
            1.회원정보삭제 | 2.회원권한삭제 | 3.뒤로가기
            -----------------------------------------------------------
            메뉴를 선택해주세요.
            """),

    MEMBER_MENU_PREVIOUS("이전 메뉴로 돌아갑니다.");

    private final String page;

    MemberPage(String page) {
        this.page = page;
    }

    public static void memberInfo(Member member) {

    }

    public static void managerInfo(Manager manager) {
        System.out.printf(MEMBER_DETAIL.toString(),
                manager.getId(), manager.getPwd(), manager.getName(),
                manager.getPhone(), manager.getEmail(), manager.getHireDate(), manager.getType());
    }

    @Override
    public String toString() {
        return page;
    }
}
